terraform `fmt`: :blue_heart:, `init`: :blue_heart:, `validate`: :blue_heart:, `plan`: :broken_heart:

<details><summary>Show Results fmt, init, validate</summary>

```
$ terraform fmt -check -diff


$ terraform init -no-color


Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/random...
- Finding latest version of hashicorp/template...
- Installing hashicorp/random v3.1.0...
- Installed hashicorp/random v3.1.0 (signed by HashiCorp)
- Installing hashicorp/template v2.2.0...
- Installed hashicorp/template v2.2.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

$ terraform validate -no-color

Success! The configuration is valid.


```

</details>

<details><summary>Show Results plan jokes/rps</summary>

```
$ terraform plan -no-color -detailed-exitcode


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.result will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "result"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            ${ result }
            
            You : ${ you } / Computer : ${ comp }
        EOT
      + vars     = {
          + "comp"   = (known after apply)
          + "result" = (known after apply)
          + "you"    = "Paper"
        }
    }

  # random_integer.comp will be created
  + resource "random_integer" "comp" {
      + id      = (known after apply)
      + keepers = (known after apply)
      + max     = 2
      + min     = 0
      + result  = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + result = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @officel, Action: `pull_request`, Workflow: `pr_jokes_rps`*
